Will_Atkinson/Ritly/app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "hash_code", "link", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-19 23:10:04.439936"], ["hash_code", 28423], ["link", "http"], ["updated_at", "2014-06-19 23:10:04.439936"]]
---
	def create
		safe_url_params = params.require(:url).permit(:link)
		@url = Url.new safe_url_params
		@url.save

SELECT  "urls".* FROM "urls"  WHERE "urls"."id" = ? LIMIT 1  [["id", 2]]
---
	def show
		@url = Url.find params[:id]

SELECT  "urls".* FROM "urls"  WHERE "urls"."hash_code" = '74225' LIMIT 1
---
	def redirector
		@url = Url.find_by hash_code: params[:code]

SELECT  "urls".* FROM "urls"  WHERE "urls"."hash_code" = '40895' LIMIT 1
---
	def preview
		@url = Url.find_by hash_code: params[:code]